###################################################################

# Created by write_sdc on Wed Oct  4 15:36:18 2023

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 0.02 [get_ports {pad[24]}]
set_load -pin_load 0.02 [get_ports {pad[23]}]
set_load -pin_load 0.02 [get_ports {pad[22]}]
set_load -pin_load 0.02 [get_ports {pad[21]}]
set_load -pin_load 0.02 [get_ports {pad[20]}]
set_load -pin_load 0.02 [get_ports {pad[19]}]
set_load -pin_load 0.02 [get_ports {pad[18]}]
set_load -pin_load 0.02 [get_ports {pad[17]}]
set_load -pin_load 0.02 [get_ports {pad[16]}]
set_load -pin_load 0.02 [get_ports {pad[15]}]
set_load -pin_load 0.02 [get_ports {pad[14]}]
set_load -pin_load 0.02 [get_ports {pad[13]}]
set_load -pin_load 0.02 [get_ports {pad[12]}]
set_load -pin_load 0.02 [get_ports {pad[11]}]
set_load -pin_load 0.02 [get_ports {pad[10]}]
set_load -pin_load 0.02 [get_ports {pad[9]}]
set_load -pin_load 0.02 [get_ports {pad[8]}]
set_load -pin_load 0.02 [get_ports {pad[7]}]
set_load -pin_load 0.02 [get_ports {pad[6]}]
set_load -pin_load 0.02 [get_ports {pad[5]}]
set_load -pin_load 0.02 [get_ports {pad[4]}]
set_load -pin_load 0.02 [get_ports {pad[3]}]
set_load -pin_load 0.02 [get_ports {pad[2]}]
set_load -pin_load 0.02 [get_ports {pad[1]}]
set_ideal_network [get_ports {pad[24]}]
set_ideal_network [get_ports {pad[22]}]
set_ideal_network [get_ports {pad[14]}]
create_clock [get_ports {pad[21]}]  -name cpu_clk  -period 10  -waveform {0 5}
set_clock_uncertainty 0.05  [get_clocks cpu_clk]
set_clock_transition -max -rise 0.15 [get_clocks cpu_clk]
set_clock_transition -max -fall 0.15 [get_clocks cpu_clk]
set_clock_transition -min -rise 0.15 [get_clocks cpu_clk]
set_clock_transition -min -fall 0.15 [get_clocks cpu_clk]
create_clock [get_ports {pad[23]}]  -name pclk  -period 20  -waveform {0 10}
set_clock_uncertainty 0.05  [get_clocks pclk]
set_clock_transition -max -rise 0.15 [get_clocks pclk]
set_clock_transition -max -fall 0.15 [get_clocks pclk]
set_clock_transition -min -rise 0.15 [get_clocks pclk]
set_clock_transition -min -fall 0.15 [get_clocks pclk]
create_clock [get_ports {pad[12]}]  -name dm_clk  -period 50  -waveform {0 25}
set_clock_uncertainty 0.05  [get_clocks dm_clk]
set_clock_transition -max -rise 0.15 [get_clocks dm_clk]
set_clock_transition -max -fall 0.15 [get_clocks dm_clk]
set_clock_transition -min -rise 0.15 [get_clocks dm_clk]
set_clock_transition -min -fall 0.15 [get_clocks dm_clk]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[1]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[2]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[3]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[4]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[5]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[6]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[7]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[8]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[9]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[10]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[11]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[13]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[15]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[16]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[17]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[18]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[19]}]
set_input_delay -clock pclk  -max 4.5  [get_ports {pad[20]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[1]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[2]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[3]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[4]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[5]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[6]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[7]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[8]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[9]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[10]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[11]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[13]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[15]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[16]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[17]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[18]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[19]}]
set_output_delay -clock pclk  -max 3  [get_ports {pad[20]}]
set_input_transition -max 0.2  [get_ports {pad[24]}]
set_input_transition -min 0.2  [get_ports {pad[24]}]
set_input_transition -max 0.2  [get_ports {pad[22]}]
set_input_transition -min 0.2  [get_ports {pad[22]}]
set_input_transition -max 0.2  [get_ports {pad[20]}]
set_input_transition -min 0.2  [get_ports {pad[20]}]
set_input_transition -max 0.2  [get_ports {pad[19]}]
set_input_transition -min 0.2  [get_ports {pad[19]}]
set_input_transition -max 0.2  [get_ports {pad[18]}]
set_input_transition -min 0.2  [get_ports {pad[18]}]
set_input_transition -max 0.2  [get_ports {pad[17]}]
set_input_transition -min 0.2  [get_ports {pad[17]}]
set_input_transition -max 0.2  [get_ports {pad[16]}]
set_input_transition -min 0.2  [get_ports {pad[16]}]
set_input_transition -max 0.2  [get_ports {pad[15]}]
set_input_transition -min 0.2  [get_ports {pad[15]}]
set_input_transition -max 0.2  [get_ports {pad[14]}]
set_input_transition -min 0.2  [get_ports {pad[14]}]
set_input_transition -max 0.2  [get_ports {pad[13]}]
set_input_transition -min 0.2  [get_ports {pad[13]}]
set_input_transition -max 0.2  [get_ports {pad[11]}]
set_input_transition -min 0.2  [get_ports {pad[11]}]
set_input_transition -max 0.2  [get_ports {pad[10]}]
set_input_transition -min 0.2  [get_ports {pad[10]}]
set_input_transition -max 0.2  [get_ports {pad[9]}]
set_input_transition -min 0.2  [get_ports {pad[9]}]
set_input_transition -max 0.2  [get_ports {pad[8]}]
set_input_transition -min 0.2  [get_ports {pad[8]}]
set_input_transition -max 0.2  [get_ports {pad[7]}]
set_input_transition -min 0.2  [get_ports {pad[7]}]
set_input_transition -max 0.2  [get_ports {pad[6]}]
set_input_transition -min 0.2  [get_ports {pad[6]}]
set_input_transition -max 0.2  [get_ports {pad[5]}]
set_input_transition -min 0.2  [get_ports {pad[5]}]
set_input_transition -max 0.2  [get_ports {pad[4]}]
set_input_transition -min 0.2  [get_ports {pad[4]}]
set_input_transition -max 0.2  [get_ports {pad[3]}]
set_input_transition -min 0.2  [get_ports {pad[3]}]
set_input_transition -max 0.2  [get_ports {pad[2]}]
set_input_transition -min 0.2  [get_ports {pad[2]}]
set_input_transition -max 0.2  [get_ports {pad[1]}]
set_input_transition -min 0.2  [get_ports {pad[1]}]
